/* automatically generated by rust-bindgen 0.72.1 */

unsafe impl Send for MaaFramework {}
unsafe impl Sync for MaaFramework {}

pub const MaaAdbScreencapMethod_EncodeToFileAndPull: u32 = 1;
pub const MaaAdbScreencapMethod_Encode: u32 = 2;
pub const MaaAdbScreencapMethod_RawWithGzip: u32 = 4;
pub const MaaAdbScreencapMethod_RawByNetcat: u32 = 8;
pub const MaaAdbScreencapMethod_MinicapDirect: u32 = 16;
pub const MaaAdbScreencapMethod_MinicapStream: u32 = 32;
pub const MaaAdbScreencapMethod_EmulatorExtras: u32 = 64;
pub const MaaAdbScreencapMethod_None: u32 = 0;
pub const MaaAdbScreencapMethod_All: i32 = -1;
pub const MaaAdbScreencapMethod_Default: i32 = -57;
pub const MaaAdbInputMethod_AdbShell: u32 = 1;
pub const MaaAdbInputMethod_MinitouchAndAdbKey: u32 = 2;
pub const MaaAdbInputMethod_Maatouch: u32 = 4;
pub const MaaAdbInputMethod_EmulatorExtras: u32 = 8;
pub const MaaAdbInputMethod_None: u32 = 0;
pub const MaaAdbInputMethod_All: i32 = -1;
pub const MaaAdbInputMethod_Default: i32 = -9;
pub const MaaWin32ScreencapMethod_None: u32 = 0;
pub const MaaWin32ScreencapMethod_GDI: u32 = 1;
pub const MaaWin32ScreencapMethod_FramePool: u32 = 2;
pub const MaaWin32ScreencapMethod_DXGI_DesktopDup: u32 = 4;
pub const MaaWin32ScreencapMethod_DXGI_DesktopDup_Window: u32 = 8;
pub const MaaWin32ScreencapMethod_PrintWindow: u32 = 16;
pub const MaaWin32ScreencapMethod_ScreenDC: u32 = 32;
pub const MaaWin32InputMethod_None: u32 = 0;
pub const MaaWin32InputMethod_Seize: u32 = 1;

#[doc = " @brief Virtual gamepad button codes for click_key/key_down/key_up\n\n Use these values with MaaControllerPostClickKey, MaaControllerPostKeyDown, MaaControllerPostKeyUp.\n Values are based on XUSB (Xbox 360) button flags. DS4 face buttons are mapped to Xbox equivalents.\n\n Xbox 360 buttons:\n\n | Value   | Button              | Description            |\n |---------|---------------------|------------------------|\n | 0x1000  | A                   | A button               |\n | 0x2000  | B                   | B button               |\n | 0x4000  | X                   | X button               |\n | 0x8000  | Y                   | Y button               |\n | 0x0100  | LB (Left Shoulder)  | Left bumper            |\n | 0x0200  | RB (Right Shoulder) | Right bumper           |\n | 0x0040  | L_THUMB             | Left stick click       |\n | 0x0080  | R_THUMB             | Right stick click      |\n | 0x0010  | START               | Start button           |\n | 0x0020  | BACK                | Back button            |\n | 0x0400  | GUIDE               | Guide/Home button      |\n | 0x0001  | DPAD_UP             | D-pad up               |\n | 0x0002  | DPAD_DOWN           | D-pad down             |\n | 0x0004  | DPAD_LEFT           | D-pad left             |\n | 0x0008  | DPAD_RIGHT          | D-pad right            |\n\n DualShock 4 buttons (aliases to Xbox buttons):\n\n | Value   | Button    | Xbox Equivalent | Description               |\n |---------|-----------|-----------------|---------------------------|\n | 0x1000  | CROSS     | A                   | Cross (X) button          |\n | 0x2000  | CIRCLE    | B                   | Circle button             |\n | 0x4000  | SQUARE    | X                   | Square button             |\n | 0x8000  | TRIANGLE  | Y                   | Triangle button           |\n | 0x0100  | L1        | LB                  | L1 button                 |\n | 0x0200  | R1        | RB                  | R1 button                 |\n | 0x0040  | L3        | L_THUMB             | Left stick click          |\n | 0x0080  | R3        | R_THUMB             | Right stick click         |\n | 0x0010  | OPTIONS   | START               | Options button            |\n | 0x0020  | SHARE     | BACK                | Share button              |\n | 0x10000 | PS        | -                   | PS button (DS4 special)   |\n | 0x20000 | TOUCHPAD  | -                   | Touchpad click (DS4 only) |"]
pub type MaaGamepadButton = u64;
#[doc = " @brief Virtual gamepad touch contact definitions for touch_down/touch_move/touch_up\n\n For gamepad controller, the touch functions are repurposed for analog inputs:\n - x, y: Analog stick position\n - pressure: Trigger value (0~255)\n\n Contact mapping:\n\n | Contact | Input           | x range     | y range     | pressure   | Description                    |\n |---------|-----------------|-------------|-------------|------------|--------------------------------|\n | 0       | Left Stick      | -32768~32767| -32768~32767| ignored    | Left analog stick X/Y position |\n | 1       | Right Stick     | -32768~32767| -32768~32767| ignored    | Right analog stick X/Y position|\n | 2       | Left Trigger    | ignored     | ignored     | 0~255      | Left trigger (LT/L2) value     |\n | 3       | Right Trigger   | ignored     | ignored     | 0~255      | Right trigger (RT/R2) value    |\n\n Usage:\n - touch_down(contact, x, y, pressure): Start analog input\n - touch_move(contact, x, y, pressure): Update analog input position/value\n - touch_up(contact): Release/reset analog input to center/zero"]
pub type MaaGamepadTouch = u64;
#[doc = " Controller feature flags returned by get_features().\n These flags indicate which input methods the controller supports/prefers."]
pub type MaaControllerFeature = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MaaRect {
    pub x: i32,
    pub y: i32,
    pub width: i32,
    pub height: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MaaRect"][::std::mem::size_of::<MaaRect>() - 16usize];
    ["Alignment of MaaRect"][::std::mem::align_of::<MaaRect>() - 4usize];
    ["Offset of field: MaaRect::x"][::std::mem::offset_of!(MaaRect, x) - 0usize];
    ["Offset of field: MaaRect::y"][::std::mem::offset_of!(MaaRect, y) - 4usize];
    ["Offset of field: MaaRect::width"][::std::mem::offset_of!(MaaRect, width) - 8usize];
    ["Offset of field: MaaRect::height"][::std::mem::offset_of!(MaaRect, height) - 12usize];
};
pub type MaaNotificationCallback = ::std::option::Option<
    unsafe extern "C" fn(
        message: *const ::std::os::raw::c_char,
        details_json: *const ::std::os::raw::c_char,
        notify_trans_arg: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " void* handle:\n - MaaTasker* for MaaTasker event\n - MaaResource* for MaaResource event\n - MaaController* for MaaController event\n - MaaContext* for MaaContext event"]
pub type MaaEventCallback = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *mut ::std::os::raw::c_void,
        message: *const ::std::os::raw::c_char,
        details_json: *const ::std::os::raw::c_char,
        trans_arg: *mut ::std::os::raw::c_void,
    ),
>;
pub type MaaCustomRecognitionCallback = ::std::option::Option<
    unsafe extern "C" fn(
        context: *mut MaaContext,
        task_id: MaaTaskId,
        node_name: *const ::std::os::raw::c_char,
        custom_recognition_name: *const ::std::os::raw::c_char,
        custom_recognition_param: *const ::std::os::raw::c_char,
        image: *const MaaImageBuffer,
        roi: *const MaaRect,
        trans_arg: *mut ::std::os::raw::c_void,
        out_box: *mut MaaRect,
        out_detail: *mut MaaStringBuffer,
    ) -> MaaBool,
>;
pub type MaaCustomActionCallback = ::std::option::Option<
    unsafe extern "C" fn(
        context: *mut MaaContext,
        task_id: MaaTaskId,
        node_name: *const ::std::os::raw::c_char,
        custom_action_name: *const ::std::os::raw::c_char,
        custom_action_param: *const ::std::os::raw::c_char,
        reco_id: MaaRecoId,
        box_: *const MaaRect,
        trans_arg: *mut ::std::os::raw::c_void,
    ) -> MaaBool,
>;
pub type MaaImageRawData = *mut ::std::os::raw::c_void;
pub type MaaImageEncodedData = *mut u8;
#[doc = " @brief The custom controller API.\n\n To create a custom controller, you need to implement this API.\n\n You do not have to implement all the functions in this API. Instead, just implement the\n functions you need. Do note that if an unimplemented function is called, the framework will\n likely crash."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MaaCustomControllerCallbacks {
    pub connect: ::std::option::Option<
        unsafe extern "C" fn(trans_arg: *mut ::std::os::raw::c_void) -> MaaBool,
    >,
    pub connected: ::std::option::Option<
        unsafe extern "C" fn(trans_arg: *mut ::std::os::raw::c_void) -> MaaBool,
    >,
    #[doc = " Write result to buffer."]
    pub request_uuid: ::std::option::Option<
        unsafe extern "C" fn(
            trans_arg: *mut ::std::os::raw::c_void,
            buffer: *mut MaaStringBuffer,
        ) -> MaaBool,
    >,
    pub get_features: ::std::option::Option<
        unsafe extern "C" fn(trans_arg: *mut ::std::os::raw::c_void) -> MaaControllerFeature,
    >,
    pub start_app: ::std::option::Option<
        unsafe extern "C" fn(
            intent: *const ::std::os::raw::c_char,
            trans_arg: *mut ::std::os::raw::c_void,
        ) -> MaaBool,
    >,
    pub stop_app: ::std::option::Option<
        unsafe extern "C" fn(
            intent: *const ::std::os::raw::c_char,
            trans_arg: *mut ::std::os::raw::c_void,
        ) -> MaaBool,
    >,
    #[doc = " Write result to buffer."]
    pub screencap: ::std::option::Option<
        unsafe extern "C" fn(
            trans_arg: *mut ::std::os::raw::c_void,
            buffer: *mut MaaImageBuffer,
        ) -> MaaBool,
    >,
    pub click: ::std::option::Option<
        unsafe extern "C" fn(x: i32, y: i32, trans_arg: *mut ::std::os::raw::c_void) -> MaaBool,
    >,
    pub swipe: ::std::option::Option<
        unsafe extern "C" fn(
            x1: i32,
            y1: i32,
            x2: i32,
            y2: i32,
            duration: i32,
            trans_arg: *mut ::std::os::raw::c_void,
        ) -> MaaBool,
    >,
    pub touch_down: ::std::option::Option<
        unsafe extern "C" fn(
            contact: i32,
            x: i32,
            y: i32,
            pressure: i32,
            trans_arg: *mut ::std::os::raw::c_void,
        ) -> MaaBool,
    >,
    pub touch_move: ::std::option::Option<
        unsafe extern "C" fn(
            contact: i32,
            x: i32,
            y: i32,
            pressure: i32,
            trans_arg: *mut ::std::os::raw::c_void,
        ) -> MaaBool,
    >,
    pub touch_up: ::std::option::Option<
        unsafe extern "C" fn(contact: i32, trans_arg: *mut ::std::os::raw::c_void) -> MaaBool,
    >,
    pub click_key: ::std::option::Option<
        unsafe extern "C" fn(keycode: i32, trans_arg: *mut ::std::os::raw::c_void) -> MaaBool,
    >,
    pub input_text: ::std::option::Option<
        unsafe extern "C" fn(
            text: *const ::std::os::raw::c_char,
            trans_arg: *mut ::std::os::raw::c_void,
        ) -> MaaBool,
    >,
    pub key_down: ::std::option::Option<
        unsafe extern "C" fn(keycode: i32, trans_arg: *mut ::std::os::raw::c_void) -> MaaBool,
    >,
    pub key_up: ::std::option::Option<
        unsafe extern "C" fn(keycode: i32, trans_arg: *mut ::std::os::raw::c_void) -> MaaBool,
    >,
    pub scroll: ::std::option::Option<
        unsafe extern "C" fn(dx: i32, dy: i32, trans_arg: *mut ::std::os::raw::c_void) -> MaaBool,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MaaCustomControllerCallbacks"]
        [::std::mem::size_of::<MaaCustomControllerCallbacks>() - 136usize];
    ["Alignment of MaaCustomControllerCallbacks"]
        [::std::mem::align_of::<MaaCustomControllerCallbacks>() - 8usize];
    ["Offset of field: MaaCustomControllerCallbacks::connect"]
        [::std::mem::offset_of!(MaaCustomControllerCallbacks, connect) - 0usize];
    ["Offset of field: MaaCustomControllerCallbacks::connected"]
        [::std::mem::offset_of!(MaaCustomControllerCallbacks, connected) - 8usize];
    ["Offset of field: MaaCustomControllerCallbacks::request_uuid"]
        [::std::mem::offset_of!(MaaCustomControllerCallbacks, request_uuid) - 16usize];
    ["Offset of field: MaaCustomControllerCallbacks::get_features"]
        [::std::mem::offset_of!(MaaCustomControllerCallbacks, get_features) - 24usize];
    ["Offset of field: MaaCustomControllerCallbacks::start_app"]
        [::std::mem::offset_of!(MaaCustomControllerCallbacks, start_app) - 32usize];
    ["Offset of field: MaaCustomControllerCallbacks::stop_app"]
        [::std::mem::offset_of!(MaaCustomControllerCallbacks, stop_app) - 40usize];
    ["Offset of field: MaaCustomControllerCallbacks::screencap"]
        [::std::mem::offset_of!(MaaCustomControllerCallbacks, screencap) - 48usize];
    ["Offset of field: MaaCustomControllerCallbacks::click"]
        [::std::mem::offset_of!(MaaCustomControllerCallbacks, click) - 56usize];
    ["Offset of field: MaaCustomControllerCallbacks::swipe"]
        [::std::mem::offset_of!(MaaCustomControllerCallbacks, swipe) - 64usize];
    ["Offset of field: MaaCustomControllerCallbacks::touch_down"]
        [::std::mem::offset_of!(MaaCustomControllerCallbacks, touch_down) - 72usize];
    ["Offset of field: MaaCustomControllerCallbacks::touch_move"]
        [::std::mem::offset_of!(MaaCustomControllerCallbacks, touch_move) - 80usize];
    ["Offset of field: MaaCustomControllerCallbacks::touch_up"]
        [::std::mem::offset_of!(MaaCustomControllerCallbacks, touch_up) - 88usize];
    ["Offset of field: MaaCustomControllerCallbacks::click_key"]
        [::std::mem::offset_of!(MaaCustomControllerCallbacks, click_key) - 96usize];
    ["Offset of field: MaaCustomControllerCallbacks::input_text"]
        [::std::mem::offset_of!(MaaCustomControllerCallbacks, input_text) - 104usize];
    ["Offset of field: MaaCustomControllerCallbacks::key_down"]
        [::std::mem::offset_of!(MaaCustomControllerCallbacks, key_down) - 112usize];
    ["Offset of field: MaaCustomControllerCallbacks::key_up"]
        [::std::mem::offset_of!(MaaCustomControllerCallbacks, key_up) - 120usize];
    ["Offset of field: MaaCustomControllerCallbacks::scroll"]
        [::std::mem::offset_of!(MaaCustomControllerCallbacks, scroll) - 128usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MaaAgentClient {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MaaToolkitAdbDevice {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MaaToolkitAdbDeviceList {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MaaToolkitDesktopWindow {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MaaToolkitDesktopWindowList {
    _unused: [u8; 0],
}
pub struct MaaFramework {
    __library: CompositeLibrary,
    pub MaaTaskerCreate: unsafe extern "C" fn() -> *mut MaaTasker,
    pub MaaTaskerDestroy: unsafe extern "C" fn(tasker: *mut MaaTasker),
    pub MaaTaskerAddSink: unsafe extern "C" fn(
        tasker: *mut MaaTasker,
        sink: MaaEventCallback,
